postgreSql/benchmarkTests/logs/sysbench_20251022T183316.log
=== PREPARE PHASE START (20251022T183316) ===
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Connecting to PostgreSQL...
Creating table if not exists: ts_v01
Table created successfully.
✅ Generated 1000 mixed IoT-style IDs
💾 Saved 1000 GUIDs to ./guid_pool.csv
=== Prepare phase started for table: ts_v01 ===
Total rows: 1000 | GUIDs: 1000 | Batch size: 100
🔄 Round 1 – inserting for 1000 GUIDs (random order)
✅ Round 1 complete — inserted 1000 / 1000 rows
🎯 Prepare phase completed (1000 rows total across 1 rounds)
=== PREPARE PHASE END (20251022T183316) ===
=== RUN PHASE START (20251022T183316) ===
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

[Thread 0] Initialized (run_batch=5, total_rows=10000, GUIDs=1000)
Threads started!

[ 5s ] thds: 1 tps: 8.18 qps: 8.18 (r/w/o: 0.00/8.18/0.00) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
     118.924 |**************************************** 19
     121.085 |**********************************       16
     123.285 |***********                              5
     125.525 |****                                     2
 
SQL statistics:
    queries performed:
        read:                            0
        write:                           42
        other:                           0
        total:                           42
    transactions:                        42     (8.27 per sec.)
    queries:                             42     (8.27 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          5.0781s
    total number of events:              42

Latency (ms):
         min:                                  118.48
         avg:                                  120.71
         max:                                  126.22
         95th percentile:                      123.28
         sum:                                 5069.88

Threads fairness:
    events (avg/stddev):           42.0000/0.00
    execution time (avg/stddev):   5.0699/0.00

=== RUN PHASE END (20251022T183316) ===
=== CLEANUP PHASE START (20251022T183316) ===
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Connecting to PostgreSQL for cleanup...
Dropping table: ts_v01
Cleanup completed.
=== CLEANUP PHASE END (20251022T183316) ===